# WallArea_Net

## Description
Returns the average of the net area of the interior and exterior face of the wall. The net area is adjusted for holes in the wall.

```pascal
FUNCTION WallArea_Net(c : CRITERIA) : REAL;
```

```python

def vs.WallArea_Net(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA||

## Version
Availability: from VectorWorks12.0
## Category
* Criteria